Repository: mltony/nvda-console-toolkit
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru, uk

source: Console Toolkit settings
ru: Настройки Инструментария для консоли
uk: Інструменти консолі

source: Speak console output in realtime
ru: Проговаривать вывод консоли в реальном времени
uk: Промовляти вивід консолі в режимі реального часу

source: Beep on update in consoles
ru: Воспроизводить звуковой сигнал при обновлении в консолях
uk: Звуковий сигнал при оновленні в консолях

source: Always enable Control+V in console (useful for SSH)
ru: Всегда включать Control+V в консоли (полезно для SSH)
uk: Завжди вмикати Control+V у консолі (корисно для SSH)

source: Method of deleting lines for prompt editing:
ru: Метод удаления строк при редактировании:
uk: Спосіб очищення рядків під час редагування запиту:

source: Suffix to be appendedd to commands in output capturing mode.
ru: Суффикс, добавляемый к командам в режиме захвата вывода.
uk: Суфікс, що додається до команд у режимі захоплення виводу.

source: Open captured output in
ru: Открывать захваченный вывод в
uk: Відкрити захоплений вивід у

source: Capture timeout in seconds:
ru: Время ожидания захвата вывода команд в секундах:
uk: Час очікування захоплення в секундах:

source: Volume of chime while capturing command output
ru: Громкость звукового сигнала захвата вывода команд
uk: Гучність сигналу під час захоплення виводу команди

source: Override shift+numPad7 behavior to take review cursor to the first visible line
ru: Shift+numPad7 перемещает просмотровый курсор на первую видимую строку
uk: Перевизначити поведінку shift+numPad7, щоб перемістити курсор перегляду на перший видимий рядок

source: Ignore repeated route review cursor events
ru: Игнорировать повторяющиеся события перемещения просмотрового курсора
uk: Ігнорувати повторні події курсору перегляду маршруту

source: Capture timeout must be a positive integer
ru: Время ожидания захвата вывода команд должно быть целым положительным числом
uk: Тайм-аут захоплення повинен бути додатним цілим числом

source: Edit text
ru: Редактировать текст
uk: Редагування тексту

source: Command output
ru: Вывод команд
uk: Вивід команди

source: Failed to set review positionreveiew
ru: Не удалось установить позицию просмотра в режиме просмотра
uk: Не вдалося встановити позицію перегляду

source: Pasted
ru: Вставлено
uk: Вставлено

source: Edit prompt
ru: Редактор запроса
uk: Редагувати запит

source: Opens accessible window that allows to edit current command line prompt.
ru: Открывает доступное окно, позволяющее редактировать текущую строку командной строки.
uk: Відкриває доступне вікно, котре дозволяє редагувати поточний рядок запиту.

source: Capture command output
ru: Захват вывода команд
uk: Захопити вивід команди

source: Executes command, captures output and presents it in accessible window.
ru: Выполняет команду, захватывает вывод и представляет его в доступном окне.
uk: Виконує команду, захоплює вивід та відображає його у доступному вікні.

source: Control character found on the screen; clear window and try again.
ru: На экране обнаружен управляющий символ; очистите окно и повторите попытку.
uk: На екрані виявлено контрольний символ; очистіть вікно та спробуйте ще раз.

source: Timed out while waiting for control characters to appear.
ru: Время ожидания появления управляющих символов истекло.
uk: Вичерпано час очікування появи контрольних символів.

source: Control+C: works in both cmd.exe and bash, but leaves previous prompt visible on the screen; doesn't work in emacs; sometimes unreliable on slow SSH connections
ru: Control+C: работает как в cmd.exe, так и в bash, но оставляет предыдущий запрос видимым на экране; не работает в emacs; иногда ненадёжен при медленных SSH-соединениях
uk: Control+C: працює як в cmd.exe, так і в bash, але залишає попередній запит на екрані; не працює в emacs; іноді ненадійний при повільних SSH-з'єднаннях

source: Escape: works only in cmd.exe
ru: Escape: работает только в cmd.exe
uk: Escape: працює тільки в cmd.exe

source: Control+A Control+K: works in bash and emacs; doesn't work in cmd.exe
ru: Control+A Control+K: работает в bash и emacs; не работает в cmd.exe
uk: Control+A Control+K: працює в bash та emacs; не працює в cmd.exe

source: Backspace (recommended): works in all environments; however slower and may cause corruption if the length of the line has changed
ru: Backspace (рекомендуется): работает во всех средах; однако работает медленнее и может привести к повреждению, если длина строки изменилась
uk: Backspace (рекомендовано): працює в усіх середовищах; однак працює повільніше і може спричинити пошкодження, якщо довжина рядка змінилася

source: Timed out while waiting for modifiers to be released!
ru: Захват прерван!Время ожидания выхода модификаторов истекло!
uk: Перевищено час очікування на відпускання модифікаторів!

source: Capture interrupted!
ru: Захват вывода команд прерван!
uk: Захоплення перервано!

source: Timed out while waiting for command output!
ru: Время ожидания вывода команды истекло!
uk: Час очікування на вивід команди закінчився!

source: Copy to clipboard
ru: Скопировать в буфер обмена
uk: Скопіювати в буфер обміну

source: Open in temporary window
ru: Открыть во временном окне
uk: Відкрити у тимчасовому вікні

source: Open in Notepad
ru: Открыть в блокноте
uk: Відкрити в блокноті

source: Open in Notepad++
ru: Открыть в Notepad++
uk: Відкрити в Notepad++

source: Command output copied to clipboard
ru: Вывод команды скопирован в буфер обмена
uk: Вивід команди скопійовано в буфер обміну

source: Console toolkit
ru: Инструментарий для консоли
uk: Інструменти консолі

source: Console Toolkit
ru: Console Toolkit (Инструментарий для консоли)
uk: Інструменти консолі

source: Accessibility improvements for Windows console.
ru: Улучшения специальных возможности консоли Windows.
uk: Покращення доступності для консолі Windows.
